app/controllers/casts_controller.rb

  def index
    @casts = Cast.all
---
SELECT * FROM "casts"